app/controllers/users_controller.rb

  def index

    @q = User.ransack(params[:q])
    @users = @q.result(distinct: true).order(name: :asc).page(params[:page])
---
SELECT  DISTINCT "users".* FROM "users" WHERE ("users"."name" ILIKE '%af%') ORDER BY "users"."name" ASC LIMIT $1 OFFSET $2  [["LIMIT", 100], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users"

  def create


    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "code", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "kurt"], ["code", 2242], ["created_at", 2016-10-17 22:21:34 UTC], ["updated_at", 2016-10-17 22:21:34 UTC]]